In [1]:
import pandas as pd

In [2]:
from IPython import get_ipython

In [3]:
df = pd.read_csv('data/EmpDataSet.csv')

In [4]:
df

  Employee ID           Name   Department   Salary
0      EMP001       John Doe    Marketing  $50,000
1      EMP002     Jane Smith           HR  $55,000
2      EMP003    Michael Lee        Sales  $60,000
3      EMP004    Emily Brown      Finance  $65,000
4      EMP005  David Johnson  Engineering  $70,000
5      EMP006   Sarah Wilson    Marketing  $55,000
6      EMP007    Kevin Clark           HR  $58,000
7      EMP008     Lisa Davis        Sales  $62,000
8      EMP009   Jason Taylor      Finance  $67,000
9      EMP010  Amanda Wright  Engineering  $72,000

In [5]:
df = pd.DataFrame(df)

In [6]:
df

  Employee ID           Name   Department   Salary
0      EMP001       John Doe    Marketing  $50,000
1      EMP002     Jane Smith           HR  $55,000
2      EMP003    Michael Lee        Sales  $60,000
3      EMP004    Emily Brown      Finance  $65,000
4      EMP005  David Johnson  Engineering  $70,000
5      EMP006   Sarah Wilson    Marketing  $55,000
6      EMP007    Kevin Clark           HR  $58,000
7      EMP008     Lisa Davis        Sales  $62,000
8      EMP009   Jason Taylor      Finance  $67,000
9      EMP010  Amanda Wright  Engineering  $72,000

In [7]:
df.columns

Index(['Employee ID', 'Name', 'Department', 'Salary'], dtype='object')

In [8]:
df.iloc[0]

Employee ID       EMP001
Name            John Doe
Department     Marketing
Salary           $50,000
Name: 0, dtype: object

In [9]:
df.iloc[1]

Employee ID        EMP002
Name           Jane Smith
Department             HR
Salary            $55,000
Name: 1, dtype: object

In [10]:
df.iloc[[0,1]]

  Employee ID        Name Department   Salary
0      EMP001    John Doe  Marketing  $50,000
1      EMP002  Jane Smith         HR  $55,000

In [11]:
df.iloc[[0,1],2]

0    Marketing
1           HR
Name: Department, dtype: object

In [12]:
df.loc[[0,1]]

  Employee ID        Name Department   Salary
0      EMP001    John Doe  Marketing  $50,000
1      EMP002  Jane Smith         HR  $55,000

In [13]:
df.loc[[0,1], 'Department']

0    Marketing
1           HR
Name: Department, dtype: object

In [14]:
df

  Employee ID           Name   Department   Salary
0      EMP001       John Doe    Marketing  $50,000
1      EMP002     Jane Smith           HR  $55,000
2      EMP003    Michael Lee        Sales  $60,000
3      EMP004    Emily Brown      Finance  $65,000
4      EMP005  David Johnson  Engineering  $70,000
5      EMP006   Sarah Wilson    Marketing  $55,000
6      EMP007    Kevin Clark           HR  $58,000
7      EMP008     Lisa Davis        Sales  $62,000
8      EMP009   Jason Taylor      Finance  $67,000
9      EMP010  Amanda Wright  Engineering  $72,000

# Performing basic data manipulation

In [15]:
df['Salary'] = df['Salary'].replace({'\$':'',',':''}, regex=True)

In [16]:
df

  Employee ID           Name   Department Salary
0      EMP001       John Doe    Marketing  50000
1      EMP002     Jane Smith           HR  55000
2      EMP003    Michael Lee        Sales  60000
3      EMP004    Emily Brown      Finance  65000
4      EMP005  David Johnson  Engineering  70000
5      EMP006   Sarah Wilson    Marketing  55000
6      EMP007    Kevin Clark           HR  58000
7      EMP008     Lisa Davis        Sales  62000
8      EMP009   Jason Taylor      Finance  67000
9      EMP010  Amanda Wright  Engineering  72000

In [17]:
type(df['Salary'])

pandas.core.series.Series

In [18]:
df['Salary'] = df['Salary'].astype(int)

In [19]:
marketing_emp = df[df['Department']=='Marketing']

In [20]:
marketing_emp

  Employee ID          Name Department  Salary
0      EMP001      John Doe  Marketing   50000
5      EMP006  Sarah Wilson  Marketing   55000

In [21]:
df_SortSal = df.sort_values(by ='Salary')

In [22]:
df_SortSal

  Employee ID           Name   Department  Salary
0      EMP001       John Doe    Marketing   50000
1      EMP002     Jane Smith           HR   55000
5      EMP006   Sarah Wilson    Marketing   55000
6      EMP007    Kevin Clark           HR   58000
2      EMP003    Michael Lee        Sales   60000
7      EMP008     Lisa Davis        Sales   62000
3      EMP004    Emily Brown      Finance   65000
8      EMP009   Jason Taylor      Finance   67000
4      EMP005  David Johnson  Engineering   70000
9      EMP010  Amanda Wright  Engineering   72000